In [428]:
import pandas as pd

In [429]:
way_file = r'C:/names'

In [430]:
def read_text(year):
    df = pd.read_csv(f'{way_file}/yob{year}.txt', names=['Name', 'Gender', 'Count'])
    df['Year'] = f'{year}'
    return df

In [431]:
def count_top3(years):
    df = list(map(read_text, years))
    df_res = pd.concat(df)
    count_top3 = df_res.groupby(['Name', 'Gender']).sum().sort_values('Count', ascending=False).head(3)
    return count_top3

In [432]:
count_top3([1880])

                Count
Name    Gender
John    M        9655
William M        9532
Mary    F        7065

In [433]:
count_top3([1900, 1950, 2000])

                Count
Name   Gender
James  M       111456
John   M       109349
Robert M       101118

In [434]:
def count_dynamics(years):
    df = list(map(read_text, years))
    df_res = pd.concat(df)
    return df_res.groupby(['Gender', 'Year']).sum()

In [435]:
count_dynamics([1900, 1950, 2000])

               Count
Gender Year
F      1900   299798
       1950  1713065
       2000  1815295
M      1900   150480
       1950  1790437
       2000  1963202